---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.GetPanel
source: html/6a2eca1f-9e8c-53d5-a3cb-fa483d721223.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.GetPanel Method

Gets the panel for this view

## Syntax (C#)
```csharp
public ElementId GetPanel()
```

## Returns
The id of the panel for this view